# Задайте число. Составьте список чисел Фибоначчи, 
# в том числе для отрицательных индексов.




# Не готова. пока не разобрался с отриццательными . 




# num_first = 0
# num_second = 1
# num = (int(input("ВВедите число: ")))
# for i in range(1,num):
#     temp = num_first
#     num_first = num_second
#     num_second = num_first + temp
#     print(num_first)



